 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>

  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>
   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">
  
     <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
</head>

<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>

 
  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading"> Кому "за 40"</h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
       <div class="block">
      
      <div class="bimg">
      <img src="img/old.png" alt="old" title="old"> 
     </div>

     <h2> нужны ли такие программисты IT-компаниям?</h2>

  <br>Ходят слухи, что после 40 лет у разработчиков ПО уже нет будущего в своей сфере. И что все возрастные  IT-специалисты вынуждены переходить в менеджмент. Давайте обсудим этот миф.<br>

  <br>На самом деле, есть очень много успешных программистов, перешагнувших 40-летний рубеж. И часть из них прямо сейчас работает над своими лучшими шедеврами. Яркий пример: создатели языка Go – Роб Пайк и Кен Томпсон – уже отпраздновали свой 60-й день рождения. В Google они занимали должности старших инженеров, и нет никаких сомнений, что обладали потрясающе богатым опытом и огромным багажом знаний.<br>

<br>Существуют и другие примеры. Взять хотя бы Роберта Мартина, Стива Возняка и Кента Бэка. Несмотря на свой возраст, они остаются очень влиятельными и авторитетными профессионалами. И похожих на них намного больше, чем вы думаете.<br>

<br>Разработчики могут развиваться и продолжать восхождение по карьерной лестнице хоть до конца своей жизни, ведь кроме хороших мыслительных способностей и умению печатать код им больше ничего не нужно. «Срок годности» IT-специалиста зависит далеко не от возрастных рамок.<br>

<br><h2>История – лучший учитель</h2>

<br>Еще недавно миллионы людей работали в промышленных фабриках, собирая автомобили, создавая для них запчасти и прочее. Машиностроение процветало, благодаря чему можно было зарабатывать себе на жизнь не самым сложным трудом на сборочных конвейерах. <br>

<br>Взять батарею и поставить ее в автомобиль – такая работа не требует углубленной технической специализации. Тем не менее, когда-то она оценивалась весьма дорого: в среднем 25 долларов за час. Естественно, многие мечтали попасть на подобное место. Но в один момент жизнь рядовых работников автомобильной промышленности кардинально изменилась по двум причинам:<br>

<br><ol>
  <li>
  Производство автоматизировали, и робототехника стала более выгодным вариантом, чем наем рабочих. Даже казалось бы дорогой робот, ценой <u>100 тыс. долларов</u>, стал обходиться дешевле, чем <u>25$/час</u>. Ведь он мог работать <u>24/7</u>, причем более стабильно и продуктивно, чем человек.
</li><br>

  <li>
    Относительно низкая стоимость услуг транспортных компаний привела к тому, что заводы массово закрывались и открывались новые в таких странах как Китай и Мексика (где полно дешевой рабочей силы).
  </li>
</ol>
  
  <br>Как раз по этим двум причинам в США начался стремительный рост безработицы. За элементарные действия, такие как закручивание болтов и крепление деталей, перестали хорошо платить. Подобные рабочие места исчезли и, вероятнее всего, навсегда.<br>
 
   <br><div class="bimg1">
     <img src="img/bost.png" alt="old" title="old"> 
   </div>
    
    <br>Многие виды человеческого труда, связанные с компьютерными технологиями, через пару десятков лет тоже перестанут существовать. Возьмем для примера веб-дизайн: благодаря массе готовых шаблонов и сервисам, позволяющим даже самому далекому от разработки человеку оформить свой сайт с нуля, только немногие веб-дизайнеры продолжат получать заказы.<br>

    <br>Раньше существовали специалисты, засовывающие перфокарты в электронно-вычислительные машины или переносящие на них написанный от руки программный код. Теперь эти профессии стали мертвыми. Как и операторы телефонных станций, они остались где-то далеко в прошлом, без единого шанса на возвращение.<br>

     <br>Так что возраст – это далеко не главная причина, по которой в будущем айтишники могут лишиться работы. Скорее всего, информационный мир изменит изобретение более эффективных способов создания программ. И в этом случае многие профессии либо трансформируются в новые, либо вообще перестанут существовать. <br>
     
        <br><h2>Как же избежать участи промышленных рабочих прошлого века?</h2><br>
        
        Прежде всего, никогда не нужно прекращать учиться чему-то новому, расти в своей сфере и получать нужные и полезные навыки. Причем знания можно как углублять, погружаясь в недра специальности, так и расширять, осваивая смежные науки, например, менеджмент, бухгалтерию, маркетинг, ораторское искусство и т.д. – одним словом, постигать все, что повысит вашу ценность, как профессионала. <br>

      <br>Статистика сайта StackOverflow говорит о том, что в <a href="https://insights.stackoverflow.com/survey/2016#developer-profile-age">2016</a> и <a href="https://insights.stackoverflow.com/survey/2015#profile-age">2015</a> г.г число работников IT-отрасли старше 40 лет составило не больше 10-13%. <br>

        <br><div class="bimg1">
          <img src="img/stats.png"alt="old" title="old">
    </div>
<br>Нельзя утверждать, что причиной столь удручающей статистики стала дискриминация по возрастному признаку. Возможно, некоторые разработчики, опасаясь пресловутого эйджизма, заранее принимают решение уйти в другую профессию и сами увольняются еще до наступления четвертого десятка.<br>

<br>Большому числу молодых людей в профессии разработчика тоже есть логичное объяснение – это простое и доступное обучение, которым молодежь умело пользуется.<br>

  <br><h2>Вывод</h2><br>

   40 лет для разработчика ПО – не приговор. Просто постоянно набирайте опыт, стремитесь приносить компании как можно больше пользы, укрепляя тем самым свое положение, и в результате вы обнаружите, что возраст не имеет никакого значения, а<u>«пенсия после 40»</u> - это миф, не имеющий никакого отношения к действительности. <br>

   <br><div class="bimg1">
          <img src="img/user.png"alt="old" title="old">
      </div>
    
       <br>Конечно, от дискриминации по возрасту никто не застрахован, и с таким явлением все еще можно столкнуться в некоторых непрофессиональных компаниях. Но помните, что каждый вправе сменить рабочее место. Т.е. всегда пытайтесь направлять внимание на те вещи, которые вам под силу изменить, и не начинайте борьбу с тем, что изменить невозможно.<br>

       <br>Итак, что мы имеем на сегодняшний день? Только около 10% разработчиков старше 40 лет. И учитывая постоянно увеличивающийся спрос на искушенных компетентных специалистов, мы советует вам даже не переживать о том, что будет ждать вас после достижения этого прекрасного возраста.<br>



         </div> 
       </div>
      </div>
  

 <!-- основаная часть справа -->

        <?php
           require_once "blocks/asidereklama.php"
         ?>      
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


      <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>