 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>

  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>
   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">
    <link rel="stylesheet"  href="css/aside.css" type="text/css" charset="utf-8">
    
      <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
</head>
<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>

 
  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading"> Java vs Kotlin: кто же круче?</h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
       <div class="block">

       <div class="bimg">
      <img src="img/jvsk.png" alt="jvsk" title="jvskj"> 
      </div>

       <br>Kotlin создавали как аналог Java. И есть мнение, что этот ученик имеет все шансы превзойти своего учителя. Мы задались вопросом, кто круче и за кем будущее Android разработки?<br>

       <br><h2>Предыстория</h2>

       <br>Создатели Kotlin начали с того, что раскритиковали Java за большое количество неудачных решений, изменить которые уже невозможно. Поэтому разработчикам нужен был новый, более комфортный язык. К решению этой проблемы команда приступила в 2010 году. <br>

       <br>Официальный релиз Kotlin состоялся в 2016-ом. Примечательно, что имя для языка выбирали путём нейминга Java. Проведя параллель с известным островом Ява (Jawa), выбор остановили на одном из островов Финского залива. В его честь и назвали. <br>

       <br>Уже в 2017 году Kotlin вошел в стандартную сборку программы Android Studio, с помощью которой пишутся все приложения для Андроид. Тогда же Google предоставила возможность разрабатывать Андроид-программы на этом юном языке.<br>
        
        <div class="bimg1">
        <img src="img/jvsk1.png" alt="jvsk" title="jvskj"> 
       </div>

       <br>А еще через пару лет, в 2019-ом, компания Google заявила, что использовать Kotlin в разработке теперь предпочтительнее, чем Java.<br>

       <br>Секрет успеха языка Kotlin - в простоте. К тому же любой написанный на нем файл без проблем открывается в Java-программах. Благодаря легкой интеграции в процессе взаимодействия ошибок можно не бояться – они не появятся. <br>

       <br>По сравнению с Java, синтаксис Kotlin более легкий, тогда как функционал языков практически не отличается.<br>

       <br><h2>Преимущества Kotlin</h2><br>
       
       <strong>1. Повышенная производительность</strong>
       <p>Создатели Kotlin достигли улучшенной производительности за счет интуитивно понятного синтаксиса. Чтобы написать программу уже нужно меньше строк, а значит и не так много времени. Таким образом, конечный результат достигается гораздо быстрее.</p><br>

       
        <strong>2. Полная совместимость с Java</strong>
       <p>Это значит, что можно функции Kotlin вызывать из Java, а методы Java – из Kotlin. Прекрасная новость и для программистов, и для крупных компаний, работающих с объемными базами данных на Java. </p><br>


         <strong>3. Простая поддержка</strong>
       <p>Работа в различных версиях может стать большой головной болью для программистов. Но не в случае Kotlin, поскольку последняя версия этого языка обратно совместима с каждой из предыдущих. </p><br>

       <strong>4. Надежность</strong>
       <p>Kotlin встроен в большинство популярных IDE (например, в Android studio и некоторые другие SDK). Поэтому у Android-разработчиков не возникает никаких трудностей при поддержке кода. Тем более, что набор инструментов остается привычным.</p><br>
      

         <strong>5. Простота в изучении</strong>
       <p>Выучить Kotlin не так сложно, как Java. Для этого даже не обязательно обладать специфическими знаниями о создании мобильных приложений.</p><br>

        
         <strong>6. Официальная поддержка Android Studio</strong>
       <p>Kotlin поддерживается Android Studio, а за счет инструментов адаптации можно одновременно применять два языка: и Java, и Kotlin. </p><br>
       
       <div class="bimg1">
       <img src="img/jvsk2.png" alt="jvsk" title="jvskj"> 
       </div>

        <br><h2>Недостатки Kotlin</h2><br>

       <strong>1. Колебания скорости компиляции</strong>
       <p>Многие программисты жалуются на то, что компиляция кода происходит с разной скоростью: иногда быстро, но в некоторых случаях гораздо медленнее обычного. </p><br>

       <strong>2. Ограниченная поддержка сообщества</strong>
       <p>МНа этапе изучения Kotlin порой будет сложно найти ответы на возникающие вопросы. Причина тому – небольшое сообщество разработчиков и нехватка обучающих ресурсов.  </p><br>

       <strong>3. Недостаточное количество разработчиков</strong>
       <p>Талантов, вовлеченных в создание Андроид-приложений на Java, гораздо больше, чем тех, кто работает с Kotlin. Несмотря на все плюсы, Kotlin сегодня используют не так активно.  </p><br>


        <h2>И что теперь будет с Java?</h2><br>

        Тех, кто начал переживать за старого доброго друга, спешим успокоить – Java никуда не денется. Да, этот язык уже и морально, и физически устарел. Но есть два весомых «но»:<br>

       <br> Во-первых, Java все еще применяется в сотнях тысяч разных программ. И он будет продолжать использоваться для их поддержки.<br>
       
        <div class="bimg1">
       <br><img src="img/jvsk3.png" alt="jvsk" title="jvskj"> 
       </div>

       <br>Во-вторых, Kotlin, как впрочем и множество других современных технологий, работает на виртуальной машине Java. И чтобы Kotlin вместе с остальными похожими языками мог выполнять свои функции, нужно обязательно поддерживать саму Java-платформу. Выходит замкнутый круг, и этот расклад очень выгоден для Java.<br>

       <br>Но тогда возникает новый вопрос: если Java в любом случае остается «боссом», зачем тогда изучать Kotlin?<br>

          <br>На самом деле появление Kotlin было потоком свежего воздуха, всколыхнувшим сферу Андроид-разработки. Создавать все на языке Java трудно, потому что его громоздкость приносит массу неудобств. Kotlin же наоборот упрощает жизнь IT-специалистов, позволяя писать код программы без использования замысловатых конструкций.        

         </div> 
       </div>
      </div>
  

 <!-- основаная часть справа -->

         <?php
           require_once "blocks/asidereklama.php"
         ?>        
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>