 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>

  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>
   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">
    <link rel="stylesheet"  href="css/aside.css" type="text/css" charset="utf-8">

  <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
</head>
<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>

 
  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading"> Что выбрать: сравнение Windows, Mac и Linux</h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
       <div class="block">
      
      <div class="bimg">
      <img src="img/wml.png" alt="jvsk" title="jvskj"> 
      </div>

       <br>Многие пользуются Windows по одной простой причине: так привычнее. Но не нужно забывать, что выбор есть всегда. И в данном случае это вопрос не только вкуса, но и профессионализма.<br>

       <br><h2>Linux</h2><br>

       Ядро данной операционной системы – важнейший компонент, который управляет работой всех программ – написал программист из Финляндии Линус Торвальдс. На сегодняшний день на основе Linux существует очень много различных ОС: для наглядности предлагаем взглянуть на перечень в <a href="https://en.wikipedia.org/wiki/List_of_Linux_distributions">Википедии.</a><br>

       <br>Особенность Linux заключается в том, что пользователь может полностью изменить систему под себя. Причем есть возможность не только экспериментировать с настройками, но и создать собственную ОС на базе Linux. <br>

       <br>К примеру, вы можете поменять дизайн на футуристический, либо с помощью <a href="https://linuxmint.com/download.php">Linux Mint</a>
       работать на привычном Windows-интерфейсе. <br>

           <div class="bimg1">
       <br><img src="img/wml1.png" alt="jvsk" title="jvskj"><br>
           </div>

       <br>Существуют даже хакерские дистрибутивы. Самый известный из них –<a href="https://www.kali.org/">Kali Linux.</a>
       Он позволяет взламывать Wi-Fi, находить уязвимости серверов, подбирать пароли, сканировать сети и содержит много других полезных программ из сферы информационной безопасности. <br>

      <br>В каждом дистрибутиве есть терминал. На вид он кажется довольно невзрачным, зато делает процесс управления компьютером и серверами более быстрым, чем в случае с программами <strong>GUI</strong>. Не зря большинство сайтов сейчас работают именно на Linux-серверах.<br>
     
        <br><h2>Плюсы и минусы </h2>

        <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>С Linux вы получите все нужные инструменты и ПО для разработки. Сообщество операционной системы, да и частные программисты тоже, выпускают много аналогов. <br>

         <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Распространяется Linux абсолютно бесплатно. Ей оказывают поддержку как небольшие компании, так и гиганты вроде Microsoft. <br>

          <br> <i class="fas fa fa-minus" style="color: red;">&nbsp;</i>Некоторых привычных программ нет для Linux. Например, iTunes и продуктов Adobe, в частности всем известного Photoshop. В Steam тоже запускаются не все игры. 


  <br>Тем не менее, ситуацию спасают аналоги популярных программ и игр. Прекрасной альтернативой iTunes является музыкальный сервис Spotify. А с помощью Wine можно и на Linux запустить многие не предназначенные для данной системы продукты. В Steam также предусмотрен специальный режим: пару изменений в настройках, и с играми тоже нет никаких проблем. <br>










 <br> <h2>MacOS</h2>
   Теперь рассмотрим MacOS – ОС от компании Apple. Установить ее легально можно только на ПК фирмы-производителя. <br>

               <div class="bimg1">
          <br><img src="img/wml2.png" alt="jvsk" title="jvskj"><br>
               </div>

          MacOS имеет много похожего с Linux, потому что это Unix-подобная операционная система, только исходный код в ней – закрытый. Вам будет легко в ней освоиться, если вы уже знакомы с терминалом и функционалом Linux. <br>

           <br><h2>Плюсы и минусы </h2>
                
                  <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Для MacOS существует огромное множество программ. С этой ОС можно заниматься как веб-разработкой, так и созданием мобильных приложений под iOS-устройства. Так что если вы хотите начать писать продукты для iPhone и размещать их в App Store, вам придется перейти на MacOS. <br>


                   <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Данную систему удобно использовать для веб-разработки: есть много подходящих инструментов и ПО. А если, занимаясь написанием кода, вы захотите сделать перерыв и поиграть, выбрать будет из чего, ведь под MacOS адаптировано много популярных игр.  <br>


                  <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Разработчики всего мира используют MacOS благодаря ее надежности и удобству. Особенно отмечают клавиатуру MacBook, идеально подходящую для печатания программного кода. <br>


                  <br> <i class="fas fa fa-minus" style="color: red;">&nbsp;</i>Высокая стоимость. Но её можно назвать оправданной из-за долговечности маков. К тому же, обращаясь с устройством должным образом, вы в любой момент сможете легко его продать, потому что MacBook долгое время не теряет востребованности на вторичном рынке. <br>
                   







                  <br><h2>Windows</h2><br>

                  С Windows знаком каждый, поэтому без лишних слов кратко пройдемся по главным плюсам и попробуем выявить возможные недостатки.<br>
                      <div class="bimg1">
                  <br><img src="img/wml3.png" alt="jvsk" title="jvskj"><br>
                      </div>
                 
                  <br>Плюсы и минусы <br>

                  <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Windows – самая популярная ОС. И поэтому для нее есть почти все программы, она работает почти со всеми известными устройствами.<br>

                  <br><i class="fas fa fa-minus" style="color: red;">&nbsp;</i>Большую популярность можно считать и недостатком, поскольку для Windows создается и распространяется больше всего вирусов, рекламного ПО, скрытых криптовалютных майнеров и т. п. <br>
                
                  <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Под Windows можно найти самые разные редакторы кода и специальные инструменты для программирования. Но, в отличие от Linux, у них есть некоторые минусы. К примеру, в Windows Home с точки зрения разработки функционал работает недостаточно полноценно.<br>

                  <br><i class="fas fa fa-plus" style="color: green;">&nbsp;</i>Чаще всего компьютеры поставляются именно с Windows. <br>

                  <br> <i class="fas fa fa-minus" style="color: red;">&nbsp;</i>Редакции ОС быстро устаревают и перестают подходить для решения некоторых задач. Поэтому приходится постоянно приобретать новую нужную версию.<br>




                  <br><h2>Подытожим:</h2>

                  <br>Linux<br>

                <br><ul>
                    <li>Пригодность для разработки – 5 баллов;</li><br>
                    <li>Универсальность (поддержка игр, ПО) – 3 балла;</li><br>
                    <li>Кастомизация (настройка под свои нужды) – 5 баллов;</li><br>
                    <li>Стоимость – бесплатно. </li>
                  </ul>
               


                <br>MacOS<br>

                <br><ul>
                    <li>Пригодность для разработки – 5 баллов;</li><br>
                    <li>Универсальность (поддержка игр, ПО) – 4 балла;</li><br>
                    <li>Кастомизация (настройка под свои нужды) – 3 баллов;</li><br>
                    <li>оимость – бесплатно (установить легально можно только на Mac-устройства). </li>
                  </ul>



               <br>Windows<br>

                <br><ul>
                    <li>Пригодность для разработки – 4 баллов;</li><br>
                    <li>Универсальность (поддержка игр, ПО) – 4 балла;</li><br>
                    <li>Кастомизация (настройка под свои нужды) – 3 баллов;</li><br>
                    <li>Стоимость – платно. </li>
                  </ul>

         </div> 
       </div>
      </div>
  

 <!-- основаная часть справа -->

         <?php
           require_once "blocks/asidereklama.php"
         ?>        
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>