 
 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>

   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">
    <link rel="stylesheet"  href="css/aside.css" type="text/css" charset="utf-8">

  <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">
  
     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab|Suez+One&display=swap">
</head>

<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>


  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading">Как стать богатым программистом?</h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
         <div class="block">


<div class="bimg">
<img src="img/pg.png" alt="test" title="css3">
</div>


  <br>Существует несколько общепринятых стратегий для повышения доходности в сфере программирования. В статье мы расскажем про 3 действенных способа стать более богатым разработчиком.<br><br>

<h3>#1 - Разработка ПО и управленчиские качества</h3>

<br>Труд управленцев высоко оценивается в любой сфере, ИТ – не исключение. Технические и генеральные директора получают в среднем 200 тысяч рублей в месяц. Не отстают от них и архитекторы ПО с системными инженерами – их зарплата составляет около 180 тысяч рублей. <br>

<br>Как бы парадоксально это ни звучало, хороший директор вовсе не обязан обладать глубокими знаниями в технологиях. Главное ему нужно быть лидером: энергичным, организованным и харизматичным; уметь вести переговоры, работать с коллективом, координировать его деятельность. Именно такие личности чаще и быстрее всего добиваются успеха в управлении.<br>

<br>Что делать:<br>
<ul>
  <li>совершенствовать навыки руководителя (коммуникативные, тайм-менеджмент и т. д.);</li>
  <li>расширять круг общения, запускать проекты;</li>
  <li>говорить о своих достижениях внутри организации и снаружи;</li>
  <li>знать экономику проектов;</li>
  <li>всегда быть ответственным за результат ("запускать продукт", а не просто "писать код"). </li><br>
</ul>
<h2>#2 - Учить востребованные языки</h2>

<br>Согласно данным 2019 года, самые большие зарплаты получают специалисты <u>Elixir</u>,<a href="https://www.youtube.com/watch?time_continue=1&v=pfmxPtLIW34&feature=emb_logo">Go</a> ,<a href="https://www.youtube.com/watch?v=DjDL5cjLYwE&feature=emb_logo">Kotlin</a> ,Scala и Objective-C. Их средний ежемесячный доход равен 130 тысячам рублей.<br>

<br>Совсем немного отстают программисты <a href="https://www.youtube.com/watch?v=1MYbDz06B1E&feature=emb_logo">Ruby</a> ,<a href="https://www.youtube.com/watch?v=Zxpz5tRrUvU&feature=emb_logo">Java</a> ,<a href="https://www.youtube.com/watch?v=3FWqP80fNJM&feature=emb_logo">C#</a> ,<a href="https://www.youtube.com/watch?v=qSHP98i9mDU&feature=emb_logo">C++ </a> и <a href="https://www.youtube.com/watch?v=n0xtO0x81cg&feature=emb_logo">Python</a>  с окладом около 100 тысяч. Заметьте, что лучшие разработчики всех этих языков получают 250 или даже 300 тысяч рублей. <br>

<br>Что делать:<br>
<ul>
   <li>выучить Java — пользуется спросом, хорошо платят;</li>
   <li>выучить Golang — пользуется спросом, небольшая конкуренция, высокие зарплаты;</li>
   <li>выучить Python — удобно, перспективно, приличные оклады.</li>
</ul>



<br><div class="bimg1">
<img src="img/graf.png" alt="график" title="гарфик">
</div><br>



<h2>#3 - Освоить data science</h2>

<br>Сеть переполнена огромными массивами данных, и теперь крайне необходимы специалисты, которые умеют со всей этой информацией работать: обрабатывать, анализировать, структурировать и т.д. Таких людей совсем мало, и этот вид деятельности с уверенностью можно назвать профессией будущего.<br>

<br>Что делать:
<ul>
   <li>начать изучение data science, аналитики и языка программирования Python — вот 3 основные направления;</li>
   <li>принимать участие в конференциях, посещать встречи, посвященные данной теме. Сфера только зарождается, поэтому нужно внимательно следить за последними новостями.</li>
</ul>

<br><strong>Главный секрет</strong><br>

<br>Что бы ни говорила статистика, жизнь каждого конкретного человека редко соответствует стандартам и подчиняется правилам. Вы имеете все шансы как стать состоятельным разработчиком на Python, получая 350 тысяч рублей, так и очень востребованным инженером-программистом 1С с зарплатой больше 1 млн рублей, которые вам будут готовы платить за решение невероятно сложных задач. Во втором случае вы не попадете в средние статистические значения, зато станете удачным исключением.<br>

<br>Ключевые правила богатства:<br>
<br>
<ul>
  <li>хорошо владеть выбранным языком;</li>
   <li>больше беспокоиться не о самом программировании, а о том, как лучше решить задачи своих клиентов, заказчиков и работодателей; всего</li>
   <li>заводить новые знакомства, общаться, демонстрировать свои успехи, интересоваться работой других людей, кипеть среди разработчиков и заставлять их кипеть вместе с вами.</li>

<br>Одним словом, не ждать манну небесную – богатство само на вас не свалится. Хотя вы же программисты, вам и так это прекрасно известно.<br>

    

         </div> 
       </div>
      </div>
  
   

   


 <!-- основаная часть справа -->

         <?php
           require_once "blocks/asidereklama.php"
         ?>        
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>
        

       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>