 
 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>

   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">

    <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab|Suez+One&display=swap">
</head>

<style type="text/css">
 .bimg>img{
    height: 300px;
    width: 1050px;
  }

   .block>iframe {
    margin-left: 59px;
  }


</style>
   

<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>


  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading">Уроки PHP </h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
 <div class="block">
  
  <div class="bimg">
    <img src="img/php8.png">
  </div><br>

 <br><center><h2>Изучение PHP | Урок №1 - Основы PHP</h2><br></center>

PHP – это один из самых распространённых языков сценариев с широкой сферой применения и opensource-кодом. Если упростить определение, это язык программирования, использующийся для создания веб-приложений (сценариев) и исполняющийся на стороне сервера. <br>


<br><h2>Видеоурок</h2><br>

<iframe width="560" height="315" src="https://www.youtube.com/embed/jqF6LYh6y2U" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe><br>

<br>Вначале пути по освоению PHP нужно познакомиться с теорией и определениями. Первоочередной вопрос, что собой представляет PHP?<br>


<br><h2>Базовое представление о PHP</h2><br>

PHP – это аббревиатура от «Hypertext Preprocessor». Корни синтаксиса уходят глубоко в C, Java и Perl. Язык довольно легко даётся в изучение. Главным его преимуществом является быстрый и простой доступ к генерированию веб-страниц. Ещё одно важное достоинство PHP в сравнении с Perl или C – это блоки PHP-кода, которые можно внедрять прямо в документ с HTML.<br>


<br>Отличительная черта языка заключается в том, что он обрабатывается на стороне сервера. При помощи нехитрых действий можно создать такой код, что автоматически создаёт страницу, ничем не отличающуюся от чистого HTML-кода. Пользователь не сможет догадаться что перед ним обычный HTML или результат работы PHP.<br>

<br>На основе PHP реально создавать высокопроизводительные и нагруженные веб-приложения в сжатые сроки. Готовые продукты несложно редактировать, улучшать и поддерживать.<br>


<br><div class="bimg1">
    <img src="img/php9.png">
  </div><br>

PHP один из тех языков, с которых можно начинать путь программиста. Несмотря на лёгкость освоения, язык очень функционален, он готов выполнять даже сложные задачи. Даже если вы не знаете ничего о PHP и программировании в целом, особого труда с освоением возникнуть не должно. Нет сомнений, что уже спустя пару часов изучения PHP вы научитесь создавать первые скрипты.<br>

<br>PHP относится к тем языкам, что регулярно улучшаются и развиваются. Он точно будет занимать лидирующие места в сфере веба ещё достаточно долго. Ближайшие 10-15 лет программисты на PHP будут востребованы.<br>

<br><h2>Что значит «серверный язык»?</h2><br>

Язык PHP ценят за мощность и гибкость. Он выступает связующим звеном между клиентом и базой данных, а также выполняет базовую обработку всех входных параметров от пользователя. Всё это стало возможным благодаря работе скриптов на стороне сервера.<br>


<br><u>Практическая сторона вопроса:</u><br>

<br><ul>
  <li>Удобно создает страницы или их фрагменты, которые одинаково отображаются у каждого пользователя;</li><br>
  <li>PHP все равно какая производительность компьютера у пользователя или какая операционная система стоит. Вся обработка данных происходит на сервере;</li><br>
  <li>Для получения новых данных на странице обязательно потребуется её обновление (если не прибегать к JS). До обновления страницы стандартными средствами PHP нельзя что-либо менять на ней. Иначе говоря, язык не интерактивный. С помощью Ajax, уже реально обновлять данные веб-страницы без её перезагрузки.</li>
</ul><br>


<h2>Советы начинающим программистам</h2><br>

Как вы уже поняли, PHP применяется для разработки сайтов. В создании веба участвуют и другие языки, ключевые из них <a href="">HTML</a> и <a href="">CSS</a>.Исключительно с помощью PHP не создать сайт. HTML – это структура страницы, а CSS – её стили (цвета, расположение, эффекты и т. п.). <br>


<br><div class="bimg1">
    <img src="img/php11.png">
  </div><br>

  Важной частью работы с PHP является взаимодействие с базой данных (БД). В ней хранятся базовые данные о пользователе, статьи, заметки и различные другие данные. Добавление, изменение и извлечение данных с БД – это те задачи, с которыми постоянно сталкивается PHP-программист. Именно поэтому должное внимание стоит уделить изучению языка запросов <a href="">SQL.</a><br>

  <br>У нас на сайте уже есть курсы по изучению <a href=""> JavaScript</a>, <a href="">HTML</a> и <a href=""> CSS</a> которые помогут преодолеть пропасть между начинающим и профессиональным программистом.<br>

  <br><h2>Итог</h2>

  <br>Сегодня PHP сохраняет актуальность, при чём такая тенденция будет сохранятся и далее. Хоть и существуют достойные альтернативы языку, но согласно <a href="https://w3techs.com/technologies/details/pl-php">статистике w3techs</a>, <u>83%</u> сайтов применяют именно PHP в качестве основного серверного языка. Это значит, что разработчику на PHP всегда найдётся работа с конкурентной оплатой.







   <br><br></b> <strong>Продолжения уроков по ссылке на Youtube канал <a href="https://www.youtube.com/watch?v=jqF6LYh6y2U&feature=emb_logo">нажми на ссылку...</a></strong>

  </div> 
</div>
</div>
  









 <!-- основаная часть справа -->

           <?php
           require_once "blocks/asidereklama.php"
         ?>      
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>