 
 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>

   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">

    <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab|Suez+One&display=swap">
</head>

<style type="text/css">
 .bimg>img{
    height: 300px;
    width: 1050px;
  }

   .block>iframe {
    margin-left: 59px;
  }


</style>
   

<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>


  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading">Уроки C++ </h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
 <div class="block">
  
  <div class="bimg">
    <img src="img/c++2.png">
  </div><br>

 <br><center><h2>Уроки C++ с нуля / Урок #1 - Основы</h2><br></center>


С++ - это компилируемый, высокоуровневый язык программирования. Может использоваться в большинстве сфер применения. Предназначающаяся для разработки разнообразных приложений. На сегодня – это один из популярнейших и известнейших языков. <br>

<br><h2>Видеоурок</h2><br>


<iframe width="560" height="315" src="https://www.youtube.com/embed/qSHP98i9mDU" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe> <br>


<br>Полезные ссылки:<br>

<br><ul>
  <li>Установка <a href="https://purecodecpp.com/archives/96">Visual Studio</a>;</li><br>
  <li>Онлайн <a href="http://cpp.sh/"> компилятор</a>;</li><br>
  <li>Большой <a href="https://www.youtube.com/watch?v=kRcbYLK3OnQ&list=PLQOaTSbfxUtCrKs0nicOg2npJQYSPGO9r">курс по C++</a>.</li><br>
</ul><br>

<br><h2>Информация про C++</h2><br>

С++ берёт основу в языке Си, активно разрабатываемом ещё в 1969-1973 годах. За разработку отвечала компания Bell Labs во главе с главным разработчиком Деннис Ритчи. Через 10 лет программист из Дании Бьёрн Страуструп, в своё время являвшийся разработчиком Си, выпускает расширенную версию языка под названием С++. Вначале своего пути C++ являлся всего лишь расширением, неким дополнением к Си, которое расширяло язык, добавляя в него принципы ООП. Сам Страуструп изначально рассматривал язык всего лишь как «Си с классами».<br>


<br>Дата рождения C++ приходится на 1983 год. Хоть он и не являлся полноценным языком, а лишь ответвлением от Си, но всё же имел ряд полезных функций за счёт которых и стал полноценным отдельным языком программирования. С выходом C++ в мире появилось ряд, ныне общераспространённых, понятий:<br>

<br><ul>
  <li>Инициация классов с объектами;</li><br>
  <li>Принцип наследования в ООП;</li><br>
  <li>Выгрузка и удаление функций из памяти;</li><br>
  <li>Создание виртуальных функций;</li><br>
  <li>Система исключений и многое другое.</li><br>
</ul>


<br><h2>А что же язык Си?</h2><br>

Язык Си по сей день сохраняет популярность даже несмотря на развитие C++ и доминирующее положение последнего языка в сфере функциональности. Почему старый и менее развитый язык даже сегодня популярен? Всё просто – переносить программы на новый язык - довольно затратное и долгое дело. Часть компаний просто плывут по течению и продолжают поддерживать свои программы на Си.<br>

<br>В сети очень многие специалисты дают советы, что начать изучение С-подобных языков лучше с Си. Они говорят, что только так можно лучше понять суть С++. В реальности – это неправильное мнение. Если начать изучение с С++, в арсенале разработчика появятся знания о более новых и современных возможностях языка. Если когда-то появится необходимость перейти на Си, это не потребует много времени и сил. Даже сам факт необходимости перехода на довольно старый Си уже вызывает большие сомнения.<br>

<br>Но если вы все же хотите изучить Си перед языком C++, то предлагаем вам ознакомиться с большим видео уроком, в котором вы сможете познакомиться с этим языком:<br>

<br><iframe width="560" height="315" src="https://www.youtube.com/embed/t0_IRViZcHs" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe><br>

<br><h2>Распространение C++</h2><br>

В скоре после выхода язык С++ начал завоёвывать различные сферы программирования. Постепенно в него внедряли всё новые функции, что всё больше отдаляло его от роли дополнения к Си. Годами позже его перестали рассматривать продолжением или расширением и пришло время полностью отделиться от Си, тогда-то язык и назвали С++. С тех пор путь языков разошёлся, они стали независимыми (насколько это возможно).<br>

<br><div class="bimg1">
   <center> <img src="img/cpp.gif"></center>
  </div><br>


Сегодня С++ - это функциональный и мощный язык, который получил в наследство от Си массу ключевых возможностей по управлению памятью. По этой причине он активно применяется в системном программировании.<br>

<br>Несколько ключевых сфер использования:<br>

<br><ul>
  <li>Разработка операционных систем. в том числе система Windows преимущественно базируется на С++;</li><br>
  <li>Создание драйверов;</li><br>
  <li>Написание программ с нуля;</li><br>
  <li>Разработка и поддержка антивирусных приложений и прочего.</li><br>
</ul><br>

С++ ушёл далеко за пределы исключительно системного программирования. Он может участвовать в создании приложений всех уровней, в которых стоит акцент на быстродействии и работе под высокими нагрузками. Применяется для формирования графических редакторов и прикладных приложений.<br>


<br>Весьма много игровых движков, предназначенных для визуализации огромного игрового мира, основываются на С++. За последние года всё больше мобильных приложений используют данный язык. Даже в сфере веба нашлось место этому языку. Всевозможные веб-приложения активно используют С++, не обязательно в качестве основы, может просто для реализации вспомогательных функций, но факт остаётся фактом. Если подытожить: сложнее найти сферы, в которых С++ не может применяться, чем там, где используется этот язык.<br>


<br><div class="bimg1">
   <center> <img src="img/cpp2.gif"></center>
  </div><br>

<br><h2>Ключевые особенности C++</h2><br>


С++ относится к компилируемым языкам, то есть компилятор изменяет код C++, преображая его в машинный с помощью предустановленных инструкций. Все платформы отличаются некоторыми особенностями, из-за чего нельзя взять и перенести программу с одной на другую платформу. Точнее, перенести можно, но она там не запустится. При этом исходный код приложения преимущественно переносится. Единственное исключение – использование специфических возможностей конкретной ОС.<br>

<br>У С++ есть компиляторы и инструменты для работы с кодом на большинстве известных платформ. Это позволяет скомпилировать исходники под любую платформу.<br>

<br>С++ поддерживает написание программ в стиле ООП, чего не умеет Си. В этом случае приложение становится лишь набором классов, объектов, которые способны взаимодействовать с другими элементами кода. Это помогает в разработке крупных приложений.<br>


<br><h2>Как поэтапно развивался С++?</h2><br>

Шаги развития С++:<br>


<br><ul>
  <li>1979-1980 – С++ появился и позиционировался, как язык Си с дополнительными классами;</li><br>
  <li>1983 – язык начал называться, как все мы привыкли С++;</li><br>
  <li>1985 – релиз коммерческого варианта С++. В этот же год появилась первая бумажная книга «Языка программирования C++», она включала описание функций, возможностей и правил использования языка;</li><br>
  <li>1989 – выпущена вторая версия языка с расширенными возможностями;</li><br>
   <li>С 1990 до 2011 – медленное развитие и добавление функционала. Также стоит упомянуть, что в 1998 году впервые попытались стандартизировать язык. Тот стандарт впоследствии назвали ISO/IEC 14882:1998, сегодня - С++98. В 2003 году появилась следующий вариант стандарта C++03;</li><br>
  <li>2011 – издание стандарта C++11, в нём появилось действительно много нововведений. Обновление обогатило язык обилием полезных возможностей;</li><br>
  <li>2014 – выпуск относительно малого добавления к предыдущей версии стандарта. Его прозвали C++14;</li><br>
  <li>2017 – последний крупный релиз языка.</li><br>
</ul><br>


<br><div class="bimg1">
   <center> <img src="img/cpp3.gif"></center>
  </div><br>

<br><h2>Среды программирования, компиляторы</h2><br>

Для написания программы на C++ обязателен компилятор, который преображает изначальный код в подходящий к исполнению в файле. Сегодня компиляторов неисчислимое количество. Они различаются по массе параметров, в том числе по способу реализации стандартов. На этапе выбора компилятора лучше выбирать те, что постоянно поддерживаются и обновляются.<br>

<br>Для работы с C++ необходимо установить среду разработки. Вы можете установить любую удобную для вас среду или же вовсе воспользоваться онлайн компилятором, что представлен на этой странице ниже. Среди самых популярных сред разработки можно отметить такие, как: <a href="https://www.microsoft.com/ru-ru/download/details.aspx?id=48145">Visual C+</a>, <a href="https://developer.apple.com/xcode/">Xcode</a>(только Мак), <a href=" GCC">GCC</a>, <a href="https://software.intel.com/en-us/c-compilers">Intel C++ Compiler</a>, <a href="https://www.softportal.com/get-403-borland-c-compiler.html">Embarcadero (Borland) C++ Builder</a>.<br>







   <br><br></b> <strong>Продолжения уроков по ссылке на Youtube канал <a href="https://www.youtube.com/watch?v=jqF6LYh6y2U&feature=emb_logo">нажми на ссылку...</a></strong>

  </div> 
</div>
</div>
  









 <!-- основаная часть справа -->

           <?php
           require_once "blocks/asidereklama.php"
         ?>      
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>