 
 <!-- реклама  -->
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>itPro - сайт для разработчиков</title>

   <link rel="stylesheet"  href="css/main.css" type="text/css" charset="utf-8">

    <link rel="stylesheet"  href="css/asidereklama.css" type="text/css" charset="utf-8">

     <meta name="description" content="Информационно-развлекательный портал для программистов! Обучающие курсы,новости в сфере IT и многое другое">
     <meta name="keywords" content="itPro,it,курсы,новости,уроки">
     <meta name="viewport" content="width=device-width, initial=scale=1">
     <link href="img/favicon.ico" rel="shortcut icon"type="imge/x-icon">
     <link href="css/fontawesome.min.css" rel="stylesheet">
      <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab|Suez+One&display=swap">
</head>

<style type="text/css">
 .bimg>img{
    height: 350px;
    width: 1050px;
  }

   .block>iframe {
    margin-left: 59px;
  }


</style>
   

<body>
    <div id="wrapper">
        <div id="content">
          
                  <?php
                    require_once "blocks/header.php"
                  ?>


  <!-- основаная часть слева -->
       <div id="main">
          <div id="news">
            <h2 class="heading">Уроки C++ </h2>
            <div style="clear: both;"><br></div>

            <!-- Основная страница -->
         
 <div class="block">
  
  <div class="bimg">
    <img src="img/max.png">
  </div><br>

 <br><center><h2>Уроки C# .NET Windows Forms / #1 - Создание приложения на C#</h2><br></center>

В ходе курса вы научитесь работать с C# .NET Windows Forms, а также создадите приложение с дизайном и подключением к базе данных. Вы изучите как подключать программы к базе данных, поработайте с MySQL, а также создадите красивый дизайн для приложения. <br>

<br><h2>Видеоурок</h2><br>

<iframe width="560" height="315" src="https://www.youtube.com/embed/gp2rA0rgq_0" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe><br>

<br>Полезные ссылки:<br>

<br><ul>
  <li>Курс по <a href="https://www.youtube.com/watch?v=KyFWqbRfWIA">Языку С#</a>;</li><br>
  <li>Курс по созданию <a href="https://itproger.com/course/asp-net"> сайта на С#</a>;</li><br>
  <li>Скачать <a href="https://visualstudio.microsoft.com/">Visual Studio</a>.</li><br>
</ul><br>

<br><h2>Информация про C#</h2><br>

Благодаря незаурядной мощности языка, на него пал выбор разработчиков движка <a href="">Unity</a>.Сегодня является одним из топовых движков для игр на Windows. Выпуск и активное использование движка пошли на руку C#, который стал ещё популярнее.<br>

<br>После базового изучения принципов работы с языком и его синтаксисом, можно сразу перейти к углублённому изучению библиотек и смежных технологий. Большинство современных проектов пишутся с их привлечением, на чистом C# работают редко.<br>

<br>Если сравнить С# с прочими языками, его можно назвать довольно молодым, хотя за плечами уже пройден немалый путь. Впервые полноценная версия языка появилось после выхода Microsoft Visual Studio .NET, событие датируется февралём 2002 года. На сегодня актуальная версия - C# 7.0, выпущенная 7.03.2017 параллельно с Visual Studio 2017.<br>

<br><div class="bimg1">
   <center> <img src="img/win.gif"></center>
  </div><br>

В <a href="">C#</a> используется синтаксис, сильно напоминающий Си и приближённый к <a href="https://ru.wikipedia.org/wiki/C%2B%2B">C++</a>, <a href="https://ru.wikipedia.org/wiki/Java">Java</a>. Если есть познания в одном из перечисленных языков, изучить C# станет значительно легче. <br>

<br>C# это объектно-ориентированный язык, который немало позаимствовал из С++ и Java. Для примера, С# обладает поддержкой наследственности, полиморфизма, повторную загрузку операторов, статической типизации. Такой подходит помогает в решении распространённых задач в сфере разработки крупных приложений, сохраняющих гибкость, расширяемость и масштабируемость. C# всё ещё развивается, после каждого дополнения в языке появляются новые функции, преимущественно довольно полезные. Среди них: асинхронная работа, переменное связывание, лямбды и т. п.<br>

<br><h2>Какова роль .NET?</h2><br>

Если речь заходит о C#, часто подразумеваются технологии, связанные с платформой .NET (WPF, ASP.NET). То же самое справедливо в обратном направлении, говоря про .NET, думают про C#. Безусловно, понятия имеют жёсткую взаимосвязь, но не являются синонимами. C# - это язык, созданный для взаимодействия с фреймворком .NET. Тем не менее .NET – это довольно широкое понятие.<br>


<br><div class="bimg1">
   <center> <img src="img/win2.gif"></center>
  </div><br>

Сейчас вспоминаются слова Билла Гейтса, не дословно, но смысл таков:<u>"Платформа .NET – лучшее творение Microsoft"</u>.Может так и есть, ведь фреймворк очень мощный и постоянно используется в разработке приложений.<br>

<br>Ключевые черты платформы:<br>

<br><ul>
  <li>Работает параллельно с разными языками. Популярностью С# во многом обязан общеязыковой среде CLR. Сейчас платформа способна работать с С#, VB.NET, C++, F#, но и на этом список не заканчивается, ведь она работает с диалектами, что привязаны к .NET (наподобие Delphi.NET). После компиляции кода с любого из перечисленных языков, вся интерпретируется в общий язык CIL – это своеобразный ассемблер для .NET. Такой подход позволяет использовать несколько языков для создания подключаемых модулей программы;</li><br>
  <li>Кроссплатформенность. Данную платформу реально переносить, хоть и есть отдельные ограничения. Сегодня актуальная версия фреймворка работает на всех поддерживаемых Виндовс: от Windows Vista до «десятки». За счёт проекта Mono появилась возможность разрабатывать программы под Linux (различные дистрибутивы), Android и iOS;</li><br>
  <li>Обширная библиотека классов. .NET Framework обладает единой, унифицированной библиотекой классов, с которой работают все поддерживаемые языки. Библиотека классов пригодится при создании любых программ: от блокнота до огромного веб-сайта;</li><br>
  <li>Масса встроенных технологий. Среда CLR в сочетании с библиотекой классов – это основа для большого пакета вспомогательных технологий. Их могут использовать все программисты во время разработки приложений. В качестве примера, при взаимодействии с базами данных можно использовать технологию ADO.NET. Во время создания графических редакторов с многочисленными функциями удобно использовать WPF. Во время веб-разработки наверняка используют ASP.NET.</li><br>
</ul>

<br><div class="bimg1">
   <center> <img src="img/win3.gif"></center>
  </div><br>


Стоит упомянуть об одной особенности фреймворка и языка – автоматическая очистка хлама в памяти. Таким образом отпадает необходимость вспоминать, и вручную задавать код для высвобождения занятой памяти. Среда CLR без дополнительных команд позаботится о сборе мусора и его удалении.<br>

<br><h2>План курса</h2><br>

В ходе курса мы с вами будем изучать Windows Forms. Это платформа, на основе которой можно строить программы с графическим интересом, но при этом лишь под Windows. Мы изучим саму платформу, научимся добавлять различные объекты, добавлять к ним обработчики событий, а также познакомимся с добавлением баз данных и реализацией их внутри нашего проекта.<br>

<br>Сразу стоит сказать, что для создания красивого интерфейса вам стоит взглянуть на фреймворк C# WPF. На сайте также будут уроки по данной платформе, но прежде чем к ней приступить вам необходимо будет  разобраться с <u>Windows Forms.</u>





   <br><br></b> <strong>Продолжения уроков по ссылке на Youtube канал <a href="https://www.youtube.com/watch?v=gp2rA0rgq_0">нажми на ссылку...</a></strong>

  </div> 
</div>
</div>
  









 <!-- основаная часть справа -->

           <?php
           require_once "blocks/asidereklama.php"
         ?>      
         <div style="clear: both;"><br></div>


     <!-- низ сайта  -->
      </div>
      <?php
           require_once "blocks/footer.php"
       ?>
      </div>


       <?php
           require_once "blocks/JS_scriptsreklama.php"
       ?>
</body>
</html>